In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Using cached pandas-2.0.3-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.3 MB)
WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ReadTimeoutError("HTTPSConnectionPool(host='pypi.org', port=443): Read timed out. (read timeout=15)")': /simple/tzdata/
Collecting tzdata>=2022.1
  Using cached tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Requirement already satisfied: numpy>=1.21.0 in /home/saidi/.local/lib/python3.10/site-packages (from pandas) (1.25.2)
Requirement already satisfied: pytz>=2020.1 in /usr/lib/python3/dist-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/saidi/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, pandas
Successfully installed pandas-2.0.3 tzdata-2023.3

In [3]:
import pandas as pd

In [6]:
df = pd.DataFrame()

In [7]:
df["names"] = ["John", "Rose", "Jack"]

In [8]:
df["age"] = [12, 19, 40]

In [9]:
df["country"] = ["Kenya", "Tanzania", "Uganda"]

In [10]:
df["surname"] = ["lucha", "fletcher", "jaki"]

In [11]:
df

  names  age   country   surname
0  John   12     Kenya     lucha
1  Rose   19  Tanzania  fletcher
2  Jack   40    Uganda      jaki

In [12]:
# Other way to create dataframes

df = pd.DataFrame(columns=["Name", "Age", "Country"],
                 data=[
                     ["John", 23, "Uganda"],
                     ["Rose", 19, "Tanzania"],
                     ["Jack", 40, "Zambia"],
                     ["Joel", 12, "Burkinafaso"]
                 ])

In [13]:
df

   Name  Age      Country
0  John   23       Uganda
1  Rose   19     Tanzania
2  Jack   40       Zambia
3  Joel   12  Burkinafaso

**Loading data from a file**

In [22]:
df = pd.read_csv("Titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [25]:
type(df)

pandas.core.frame.DataFrame

**Creating Series**

In [27]:
series = pd.Series(index=["Name", "Age", "Country"], data=["Saidi", 25, "Kenya"])
series

Name       Saidi
Age           25
Country    Kenya
dtype: object

In [28]:
type(series)

pandas.core.series.Series

In [29]:
# Creating a DataFrame from a series

df = pd.DataFrame(series)
df

             0
Name     Saidi
Age         25
Country  Kenya

In [17]:
data.shape

(891, 12)

In [19]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool